miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_hmsc/src/r_usb_hstorage_driver.c
            /* Inquiry */
            usb_hmsc_inquiry(mess, side, (uint8_t*) &g_usb_hmsc_data[mess->ip]);
            g_usb_hmsc_drive_search_seq[mess->ip]++;
        break;

        case USB_SEQ_2 : /* Check result */
            if (mess->result != USB_HMSC_OK)
            {
                USB_PRINTF0("### Inquiry error\n");
            }
            /* Read Format Capacity */
            usb_hmsc_read_format_capacity(mess, side, (uint8_t*) &g_usb_hmsc_data[mess->ip]);
            g_usb_hmsc_drive_search_seq[mess->ip]++;
        break;

        case USB_SEQ_3 : /* Read Capacity */
            usb_hmsc_read_capacity(mess, side, (uint8_t*) &g_usb_hmsc_data[mess->ip]);
            g_usb_hmsc_drive_search_seq[mess->ip]++;
        break;

        case USB_SEQ_4 :
            if (mess->result != USB_HMSC_OK)
            {
                /* TestUnitReady */
                usb_hmsc_test_unit(mess, side);
                g_usb_hmsc_drive_search_seq[mess->ip]++;
            }
            else
            {
                /* Pass TestUnitReady  */
                g_usb_hmsc_drive_search_seq[mess->ip] = USB_SEQ_6;
                g_usb_hmsc_read_partition_retry_count[mess->ip] = 0;
                usb_hmsc_strg_specified_path(mess);
            }
        break;

        case USB_SEQ_5 :
            if (mess->result != USB_HMSC_OK)
            {
                /* TestUnitReady (Retry) */
                usb_hmsc_test_unit(mess, side);
            }
            else
            {
                /* Read Capacity (Retry) */
                usb_hmsc_read_capacity(mess, side, (uint8_t*) &g_usb_hmsc_data[mess->ip]);
                g_usb_hmsc_read_partition_retry_count[mess->ip] = 0;
                g_usb_hmsc_drive_search_seq[mess->ip]++;
            }
        break;

        case USB_SEQ_6 :
            /* Don't delete the following processing!! */
            /* (This is necessary for the specific USB memory.) */
            /* Read10 secno = 0, seccnt = 1 */
            usb_hmsc_read10 (mess, side, (uint8_t*)&g_usb_hmsc_data[mess->ip], 0, 1, USB_HMSC_STRG_SECTSIZE);
            g_usb_hmsc_drive_search_seq[mess->ip]++;
        break;

        case USB_SEQ_7 :
            if (USB_HMSC_OK == mess->result)
            {
                g_usb_hmsc_drive_search_seq[mess->ip] = USB_SEQ_0;
                g_usb_hmsc_strg_process[mess->ip] = USB_MSG_HMSC_STRG_DRIVE_SEARCH_END;
            }
            else
            {
                g_usb_hmsc_drive_search_seq[mess->ip] = USB_SEQ_6;
                /* Drive read error */
                USB_PRINTF0 ("### drive read error  (times ).\n");
                g_usb_hmsc_read_partition_retry_count[mess->ip]++;   /* Update Retry count */
                /* Max Retry count = 10 */
                if ((uint32_t)10 == g_usb_hmsc_read_partition_retry_count[mess->ip])
                {
                    /* Retry end. */
                    g_usb_hmsc_drive_search_seq[mess->ip] = USB_SEQ_0;
                    g_usb_hmsc_strg_process[mess->ip] = USB_MSG_HMSC_STRG_DRIVE_SEARCH_END;
                    usb_hstd_connect_err_event_set(mess->ip);
                }
            }
            usb_hmsc_strg_specified_path ((usb_utr_t *)mess);
        break;

        default :
            g_usb_hmsc_drive_search_seq[mess->ip] = USB_SEQ_0;
            g_usb_hmsc_strg_process[mess->ip] = USB_MSG_HMSC_STRG_DRIVE_SEARCH_END;
            usb_hmsc_strg_specified_path(mess);
            usb_hstd_connect_err_event_set(mess->ip);
        break;
    }
}
/******************************************************************************
 End of function usb_hmsc_strg_drive_search_act
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_strg_specified_path
 Description     : Next Process Selector
 Arguments       : usb_utr_t *mess   : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void usb_hmsc_strg_specified_path (usb_utr_t *mess)
{
    usb_utr_t *pblf;
    usb_er_t err;

    /* Get mem pool blk */
    if ( USB_PGET_BLK(USB_HSTRG_MPL,&pblf) == USB_OK)
    {
        pblf->msginfo = g_usb_hmsc_strg_process[mess->ip];
        pblf->keyword = mess->keyword;
        pblf->result = mess->result;

        pblf->ip = mess->ip;
        pblf->ipp = mess->ipp;

        /* Send message */
        err = USB_SND_MSG(USB_HSTRG_MBX, (usb_msg_t* )pblf);
        if (USB_OK != err)
        {
            err = USB_REL_BLK(USB_HSTRG_MPL, (usb_mh_t )pblf);
            USB_PRINTF0("### SpecifiedPass function snd_msg error\n");
        }
    }
    else
    {
        USB_PRINTF0("### SpecifiedPass function pget_blk error\n");
    }
}
/******************************************************************************
 End of function usb_hmsc_strg_specified_path
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_strg_check_result
 Description     : Hub class check result
 Arguments       : usb_utr_t    *mess   : Pointer to usb_utr_t structure.
                 : uint16_t     data1   : Not used
                 : uint16_t     data2   : Not used
 Return value    : none
 ******************************************************************************/
void usb_hmsc_strg_check_result (usb_utr_t *mess, uint16_t data1, uint16_t data2)
{
    mess->result = mess->status;
    usb_hmsc_strg_specified_path(mess);
}
/******************************************************************************
 End of function usb_hmsc_strg_check_result
 ******************************************************************************/
#endif /* (BSP_CFG_RTOS_USED == 0) */
#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_hmsc_strg_drive_task
 Description     : Storage drive task
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_hmsc_strg_drive_task (void)
{
    usb_utr_t *p_mess;
    usb_er_t err;

    /* receive message */
    err = USB_RCV_MSG(USB_HSTRG_MBX, (usb_msg_t** )&p_mess);
    if (USB_OK != err)
    {
        return;
    }

    switch (p_mess->msginfo)
    {
        case USB_MSG_HMSC_STRG_DRIVE_SEARCH :

