miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_hmsc/src/r_usb_hstorage_driver.c
#else /* (BSP_CFG_RTOS_USED) */
    usb_utr_t *p_blf;
    usb_er_t err;

    g_usb_hmsc_root_devaddr[ptr->ip] = addr;
    usb_shmsc_command_result[ptr->ip] = complete;
    g_usb_hmsc_drive_search_seq[ptr->ip] = USB_SEQ_0;

    /* Get mem pool blk */
    if ( USB_PGET_BLK(USB_HSTRG_MPL,&p_blf) == USB_OK)
    {
        p_blf->msginfo = USB_MSG_HMSC_STRG_DRIVE_SEARCH;
        p_blf->keyword = addr;
        p_blf->complete = complete;
        p_blf->ip = ptr->ip;
        p_blf->ipp = ptr->ipp;

        /* Send message */
        err = USB_SND_MSG(USB_HSTRG_MBX, (usb_msg_t* )p_blf);
        if (USB_OK != err)
        {
            err = USB_REL_BLK(USB_HSTRG_MPL, (usb_mh_t )p_blf);
            USB_PRINTF0("### StrgDriveSearch function snd_msg error\n");
        }
    }
    else
    {
        USB_PRINTF0("### StrgDriveSearch function pget_blk error\n");
    }
    return (err);
#endif /* (BSP_CFG_RTOS_USED) */
}
/******************************************************************************
 End of function usb_hmsc_strg_drive_search
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_strg_drive_open
 Description     : Releases drive
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : uint16_t     addr        : Device Address
                 : uint16_t     *side       : Pointer to the area to store the drive number
 Return value    : uint16_t                 : [OK/ERROR]
 ******************************************************************************/
uint16_t usb_hmsc_strg_drive_open (usb_utr_t *ptr, uint16_t addr, uint16_t *side)
{
    uint16_t retval;
    uint16_t ip_addr;

    ip_addr = addr;
    if ( USB_IP1 == ptr->ip)
    {
        ip_addr |= USBA_ADDRESS_OFFSET;
    }
    *side = usb_hmsc_alloc_drvno(ip_addr);

    if (USB_ERROR == (*side))
    {
        return USB_ERROR;
    }

    /* Set SubClass */
    g_usb_hmsc_sub_class[ptr->ip][*side] = g_usb_hmsc_tmp_sub_class[ptr->ip];

    /* Pipe Information table set */
    retval = usb_hmsc_pipe_info(ptr, g_p_usb_hmsc_interface_table[ptr->ip], *side, g_usb_hmsc_speed[ptr->ip],
            (uint16_t) g_p_usb_hmsc_config_table[ptr->ip][2]);
    if (USB_ERROR == retval)
    {
        USB_PRINTF0("### Device information error !\n");
        return USB_ERROR;
    }

#if (BSP_CFG_RTOS_USED == 0)
    g_drive_search_que[g_drive_search_que_cnt] = ip_addr;
    g_drive_search_que_cnt++;
#endif  /* BSP_CFG_RTOS_USED == 0 */
    return USB_OK;
}
/******************************************************************************
 End of function usb_hmsc_strg_drive_open
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_strg_drive_close
 Description     : Releases drive
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     side    : Drive number
 Return value    : uint16_t             : [OK/ERROR]
 ******************************************************************************/
uint16_t usb_hmsc_strg_drive_close (usb_utr_t *ptr, uint16_t side)
{
    uint16_t result;

    /* Clear Pipe */
    g_usb_hmsc_out_pipe[ptr->ip][side] = USB_NOPORT; /* Pipe initial */
    g_usb_hmsc_in_pipe[ptr->ip][side] = USB_NOPORT; /* Pipe initial */
    g_usb_hmsc_out_pipectr[ptr->ip][side] = 0; /* Toggle clear */
    g_usb_hmsc_in_pipectr[ptr->ip][side] = 0; /* Toggle clear */

    result = usb_hmsc_free_drvno(side);

    return (result);
}
/******************************************************************************
 End of function usb_hmsc_strg_drive_close
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_strg_read_sector
 Description     : Releases drive
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : uint16_t     side        : Drive number
                 : uint8_t      *buff       : Buffer address
                 : uint32_t     secno       : Sector number
                 : uint16_t     seccnt      : Sector count
                 : uint32_t     trans_byte  : Transfer size
 Return value    : uint16_t                 : [DONE/ERROR]
 ******************************************************************************/
uint16_t usb_hmsc_strg_read_sector (usb_utr_t *ptr, uint16_t side, uint8_t *buff, uint32_t secno, uint16_t seccnt,
        uint32_t trans_byte)
{
    uint16_t result;

    /* Device Status */
    if ( USB_TRUE != usb_hmsc_get_dev_sts(side))
    {
        USB_PRINTF1("### device det(usb_hmsc_strg_read_sector:side=%d)\n", side);
        return (USB_ERROR);
    }
    g_usb_hmsc_strg_process[ptr->ip] = USB_MSG_HMSC_STRG_RW_END;
    usb_shmsc_command_end_flag[ptr->ip] = USB_FALSE;
    result = usb_hmsc_read10(ptr, side, buff, secno, seccnt, trans_byte);
#if (BSP_CFG_RTOS_USED)
    if (USB_HMSC_OK == result)
    {
        usb_shmsc_command_end_flag[ptr->ip] = USB_TRUE;
        return USB_OK;
    }
    else
    {
        hmsc_error_process(ptr, side, result);

        usb_shmsc_command_end_flag[ptr->ip] = USB_ERROR;
        return USB_ERROR;
    }
#else /* (BSP_CFG_RTOS_USED) */

    return (result);
#endif /* (BSP_CFG_RTOS_USED) */
}
/******************************************************************************
 End of function usb_hmsc_strg_read_sector
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_strg_write_sector
 Description     : Writes sector information
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : uint16_t     side        : Drive number
                 : uint8_t      *buff       : Buffer address
                 : uint32_t     secno       : Sector number
                 : uint16_t     seccnt      : Sector count
                 : uint32_t     trans_byte  : Transfer size
 Return value    : uint16_t                 : [DONE/ERROR]
 ******************************************************************************/
uint16_t usb_hmsc_strg_write_sector (usb_utr_t *ptr, uint16_t side, uint8_t *buff, uint32_t secno, uint16_t seccnt,
        uint32_t trans_byte)
{
    uint16_t result;

    /* Device Status */
    if ( USB_TRUE != usb_hmsc_get_dev_sts(side))
    {
        USB_PRINTF1("### device det(usb_hmsc_strg_write_sector:side=%d)\n", side);
        return (USB_ERROR);
    }
    g_usb_hmsc_strg_process[ptr->ip] = USB_MSG_HMSC_STRG_RW_END;
    usb_shmsc_command_end_flag[ptr->ip] = USB_FALSE;
    result = usb_hmsc_write10(ptr, side, buff, secno, seccnt, trans_byte);
#if (BSP_CFG_RTOS_USED)
    if (USB_HMSC_OK == result)
    {
        usb_shmsc_command_end_flag[ptr->ip] = USB_TRUE;
        return USB_OK;
    }
    else
    {
        hmsc_error_process(ptr, side, result);

        usb_shmsc_command_end_flag[ptr->ip] = USB_ERROR;
        return USB_ERROR;
    }
#else /* (BSP_CFG_RTOS_USED) */

    return (result);
#endif /* (BSP_CFG_RTOS_USED) */
}
/******************************************************************************
 End of function usb_hmsc_strg_write_sector
 ******************************************************************************/

