miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_hmsc/src/r_usb_hstorage_driver.c
/******************************************************************************
 Function Name   : usb_hmsc_strg_check_end
 Description     : Check Read/Write end
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
 Return value    : uint16_t                 : [USB_TRUE/USB_FALSE/USB_ERROR]
 ******************************************************************************/
uint16_t usb_hmsc_strg_check_end (usb_utr_t *ptr)
{
    uint16_t end_flag;

    end_flag = usb_shmsc_command_end_flag[ptr->ip];
    usb_shmsc_command_end_flag[ptr->ip] = USB_FALSE;

    return end_flag;
}
/******************************************************************************
 End of function usb_hmsc_strg_check_end
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_strg_user_command
 Description     : USB Mass Storage Command
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : uint16_t     side        : Drive number
                 : uint16_t     command     : ATAPI command
                 : uint8_t      *buff       : Buffer address
                 : usb_cb_t     complete    : callback info
 Return value    : uint16_t                 : [DONE/ERROR]
 ******************************************************************************/
uint16_t usb_hmsc_strg_user_command (usb_utr_t *ptr, uint16_t side, uint16_t command, uint8_t *buff, usb_cb_t complete)
{
    uint16_t result;

    /* Device Status */
    if ( USB_TRUE != usb_hmsc_get_dev_sts(side))
    {
        USB_PRINTF1("### device det(StrgUserCommand:side=%d)\n", side);
        return (USB_ERROR);
    }

    switch (command)
    {
        case USB_ATAPI_TEST_UNIT_READY :
            g_usb_hmsc_strg_process[ptr->ip] = USB_MSG_HMSC_STRG_USER_COMMAND;
            usb_shmsc_command_result[ptr->ip] = complete;

            /* Test unit */
            result = usb_hmsc_test_unit(ptr, side);
#if (BSP_CFG_RTOS_USED)
            /* The result of the user command should be reported before returning this function */
            (usb_shmsc_command_result[ptr->ip])(ptr, g_usb_hmsc_drvno_tbl[side].devadr, 0); /* Result of User commands */
#endif /* (BSP_CFG_RTOS_USED) */
        break;
        case USB_ATAPI_REQUEST_SENSE :
            g_usb_hmsc_strg_process[ptr->ip] = USB_MSG_HMSC_STRG_USER_COMMAND;
            usb_shmsc_command_result[ptr->ip] = complete;

            /*Request sense */
            result = usb_hmsc_request_sense(ptr, side, buff);
#if (BSP_CFG_RTOS_USED)
            /* The result of the user command should be reported before returning this function */
            (usb_shmsc_command_result[ptr->ip])(ptr, g_usb_hmsc_drvno_tbl[side].devadr, 0); /* Result of User commands */
#endif /* (BSP_CFG_RTOS_USED) */
        break;
        case USB_ATAPI_FORMAT_UNIT :
            return (USB_ERROR);
        break;
        case USB_ATAPI_INQUIRY :
            g_usb_hmsc_strg_process[ptr->ip] = USB_MSG_HMSC_STRG_USER_COMMAND;
            usb_shmsc_command_result[ptr->ip] = complete;

            /* Inquiry */
            result = usb_hmsc_inquiry(ptr, side, buff);
#if (BSP_CFG_RTOS_USED)
            /* The result of the user command should be reported before returning this function */
            (usb_shmsc_command_result[ptr->ip])(ptr, g_usb_hmsc_drvno_tbl[side].devadr, 0); /* Result of User commands */
#endif /* (BSP_CFG_RTOS_USED) */
        break;
        case USB_ATAPI_PREVENT_ALLOW :
            g_usb_hmsc_strg_process[ptr->ip] = USB_MSG_HMSC_STRG_USER_COMMAND;
            usb_shmsc_command_result[ptr->ip] = complete;

            /* Prevent allow */
            result = usb_hmsc_prevent_allow(ptr, side, buff);
#if (BSP_CFG_RTOS_USED)
            /* The result of the user command should be reported before returning this function */
            (usb_shmsc_command_result[ptr->ip])(ptr, g_usb_hmsc_drvno_tbl[side].devadr, 0); /* Result of User commands */
#endif /* (BSP_CFG_RTOS_USED) */
        break;
        case USB_ATAPI_READ_FORMAT_CAPACITY :
            g_usb_hmsc_strg_process[ptr->ip] = USB_MSG_HMSC_STRG_USER_COMMAND;
            usb_shmsc_command_result[ptr->ip] = complete;

            /* Read format capacity */
            result = usb_hmsc_read_format_capacity(ptr, side, buff);
#if (BSP_CFG_RTOS_USED)
            /* The result of the user command should be reported before returning this function */
            (usb_shmsc_command_result[ptr->ip])(ptr, g_usb_hmsc_drvno_tbl[side].devadr, 0); /* Result of User commands */
#endif /* (BSP_CFG_RTOS_USED) */
        break;
        case USB_ATAPI_READ_CAPACITY :
            g_usb_hmsc_strg_process[ptr->ip] = USB_MSG_HMSC_STRG_USER_COMMAND;
            usb_shmsc_command_result[ptr->ip] = complete;

            /* Read capacity */
            result = usb_hmsc_read_capacity(ptr, side, buff);
#if (BSP_CFG_RTOS_USED)
            /* The result of the user command should be reported before returning this function */
            (usb_shmsc_command_result[ptr->ip])(ptr, g_usb_hmsc_drvno_tbl[side].devadr, 0); /* Result of User commands */
#endif /* (BSP_CFG_RTOS_USED) */
        break;
        case USB_ATAPI_MODE_SELECT10 :
            g_usb_hmsc_strg_process[ptr->ip] = USB_MSG_HMSC_STRG_USER_COMMAND;
            usb_shmsc_command_result[ptr->ip] = complete;

            /* Mode select10 */
            result = usb_hmsc_mode_select10(ptr, side, buff);
#if (BSP_CFG_RTOS_USED)
            /* The result of the user command should be reported before returning this function */
            (usb_shmsc_command_result[ptr->ip])(ptr, g_usb_hmsc_drvno_tbl[side].devadr, 0); /* Result of User commands */
#endif /* (BSP_CFG_RTOS_USED) */            
        break;
        case USB_ATAPI_MODE_SENSE10 :
            g_usb_hmsc_strg_process[ptr->ip] = USB_MSG_HMSC_STRG_USER_COMMAND;
            usb_shmsc_command_result[ptr->ip] = complete;

            /* Mode sense10 */
            result = usb_hmsc_mode_sense10(ptr, side, buff);
#if (BSP_CFG_RTOS_USED)
            /* The result of the user command should be reported before returning this function */
            (usb_shmsc_command_result[ptr->ip])(ptr, g_usb_hmsc_drvno_tbl[side].devadr, 0); /* Result of User commands */
#endif /* (BSP_CFG_RTOS_USED) */
        break;

        /* USB_ATAPI_FORMAT_UNIT */
        /* USB_ATAPI_MODE_SELECT6 */
        /* USB_ATAPI_MODE_SENSE6 */
        /* USB_ATAPI_START_STOP_UNIT */
        /* USB_ATAPI_READ10 */
        /* USB_ATAPI_WRITE10 */
        /* USB_ATAPI_SEEK */
        /* USB_ATAPI_WRITE_AND_VERIFY */
        /* USB_ATAPI_VERIFY10 */
        default :
            return (USB_PAR);
        break;
    }

    ptr->result = result;   /* Set BOT transfer result. (USB_HMSC_OK/USB_HMSC_CSW_ERR/USB_HMSC_CSW_PHASE_ERR...) */

    if (USB_HMSC_OK == result)
    {
        return (USB_OK);
    }
    else if (USB_PAR == result)
    {
        return (USB_PAR);
    }
    else
    {
        return (USB_ERROR);
    }
}
/******************************************************************************
 End of function usb_hmsc_strg_user_command
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_storage_driver_start
 Description     : USB Host Initialize process
 Arguments       : uint16_t ip_no  : USB IP No. (USB_IP0/USB_IP1)
 Return          : none
 ******************************************************************************/
void usb_hmsc_storage_driver_start (uint16_t ip_no)
{
    g_usb_hmsc_strg_process[ip_no] = 0;
    memset((void *)&g_usb_hmsc_data[ip_no], 0, 512);
#if (BSP_CFG_RTOS_USED == 0)
    g_usb_hmsc_read_partition_retry_count[ip_no] = 0;
#endif /* BSP_CFG_RTOS_USED == 0 */

    usb_shmsc_command_result[ip_no] = 0;
    usb_shmsc_command_end_flag[ip_no] = 0;
    g_usb_hmsc_root_devaddr[ip_no] = 0;
    g_usb_hmsc_drive_search_seq[ip_no] = 0;
}
/******************************************************************************
 End of function usb_hmsc_storage_driver_start
 ******************************************************************************/
#endif /* defined(USB_CFG_HMSC_USE) */

/******************************************************************************
 End  Of File
 ******************************************************************************/
